In [1]:
customer = pd.read_csv("customer_join.csv")
uselog_months = pd.read_csv("use_log_months.csv")

display(customer.head())
display(uselog_months.head())

,customer_id,gender,start_date,end_date,is_deleted,class,class_name,campaign_id,campaign_name,mean,median,max,min,routine_flg,calc_date,membership_period
0,OA832399,F,2015-05-01,NaN,0,C01,0_종일,CA1,2_일반,4.833333,5.0,8,2,1,2019-04-30,47
1,PL270116,M,2015-05-01,NaN,0,C01,0_종일,CA1,2_일반,5.083333,5.0,7,3,1,2019-04-30,47
2,OA974876,M,2015-05-01,NaN,0,C01,0_종일,CA1,2_일반,4.583333,5.0,6,3,1,2019-04-30,47
3,HD024127,F,2015-05-01,NaN,0,C01,0_종일,CA1,2_일반,4.833333,4.5,7,2,1,2019-04-30,47
4,HD661448,F,2015-05-01,NaN,0,C03,2_야간,CA1,2_일반,3.916667,4.0,6,1,1,2019-04-30,47

       연월 customer_id  count
0  201804    AS002855      4
1  201804    AS009013      2
2  201804    AS009373      3
3  201804    AS015315      6
4  201804    AS015739      7

In [2]:
# 기준 연월과 해당 기준 연월의 1개월 전 이용 횟수를 집계한 데이터 작성
year_months = list(uselog_months["연월"].unique())
print("year_months :", year_months)
uselog = pd.DataFrame()

for i in range(1, len(year_months)): # 1부터 반복을 도는 이유는 'year_months' 내 '201804'이전 데이터는 존재하지 않기 때문
    
    tmp = uselog_months.loc[uselog_months["연월"] == year_months[i]]
    tmp.rename(columns = {"count" : "count_0"}, inplace = True)
    tmp_before = uselog_months.loc[uselog_months["연월"] == year_months[i-1]]
    del tmp_before["연월"]
    tmp_before.rename(columns = {"count" : "count_1"}, inplace = True)
    tmp = pd.merge(tmp, tmp_before, on = "customer_id", how="left")
    uselog = pd.concat([uselog, tmp], ignore_index=True)

display(uselog.head())

year_months : [201804, 201805, 201806, 201807, 201808, 201809, 201810, 201811, 201812, 201901, 201902, 201903]

       연월 customer_id  count_0  count_1
0  201805    AS002855        5      4.0
1  201805    AS009373        4      3.0
2  201805    AS015233        7      NaN
3  201805    AS015315        3      6.0
4  201805    AS015739        5      7.0

In [3]:
# 'uselog' 데이터 셋 내 열들의 데이터 타입 확인
uselog.dtypes

연월               int64
customer_id     object
count_0          int64
count_1        float64
dtype: object

In [4]:
# 탈퇴한 회원들의 탈퇴 전월 데이터 작성
from dateutil.relativedelta import relativedelta

exit_customer = customer.loc[customer["is_deleted"] == 1]
exit_customer["exit_date"] = None
exit_customer["end_date"] = pd.to_datetime(exit_customer["end_date"])
# exit_customer.head()
for i in range(len(exit_customer)):
    
    exit_customer["exit_date"].iloc[i] = exit_customer["end_date"].iloc[i] - relativedelta(months=1)
    
#'exit_customer'데이터 셋 내 'exit_date'를 'YYYYMM'포맷의 문자열로 변경한 후, 이것을 '연월'이라는 컬럼으로 생성함
exit_customer["연월"] = exit_customer["exit_date"].dt.strftime("%Y%m")
uselog["연월"] = uselog["연월"].astype(str)
exit_uselog = pd.merge(uselog, exit_customer, on = ["customer_id", "연월"], how="left")
exit_uselog.head()

,연월,customer_id,count_0,count_1,gender,start_date,end_date,is_deleted,class,class_name,campaign_id,campaign_name,mean,median,max,min,routine_flg,calc_date,membership_period,exit_date
0,201805,AS002855,5,4.0,NaN,NaN,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,201805,AS009373,4,3.0,NaN,NaN,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,201805,AS015233,7,NaN,NaN,NaN,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,201805,AS015315,3,6.0,NaN,NaN,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,201805,AS015739,5,7.0,NaN,NaN,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [5]:
# 'exit_customer'데이터 셋 확인
exit_customer.head()

,customer_id,gender,start_date,end_date,is_deleted,class,class_name,campaign_id,campaign_name,mean,median,max,min,routine_flg,calc_date,membership_period,exit_date,연월
708,TS511179,F,2016-05-01,2018-04-30,1,C01,0_종일,CA1,2_일반,3.0,3.0,3,3,0,2018-04-30,23,2018-03-30 00:00:00,201803
729,TS443736,M,2016-05-01,2018-04-30,1,C02,1_주간,CA1,2_일반,3.0,3.0,3,3,0,2018-04-30,23,2018-03-30 00:00:00,201803
730,HD542886,M,2016-05-01,2018-04-30,1,C01,0_종일,CA1,2_일반,1.0,1.0,1,1,0,2018-04-30,23,2018-03-30 00:00:00,201803
770,HD597545,F,2016-06-01,2018-05-31,1,C03,2_야간,CA1,2_일반,3.5,3.5,4,3,1,2018-05-31,23,2018-04-30 00:00:00,201804
785,HI749296,M,2016-06-01,2018-05-31,1,C01,0_종일,CA1,2_일반,3.0,3.0,3,3,0,2018-05-31,23,2018-04-30 00:00:00,201804

In [6]:
# 'exit_uselog'데이터 셋 확인
exit_uselog.head()

,연월,customer_id,count_0,count_1,gender,start_date,end_date,is_deleted,class,class_name,campaign_id,campaign_name,mean,median,max,min,routine_flg,calc_date,membership_period,exit_date
0,201805,AS002855,5,4.0,NaN,NaN,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,201805,AS009373,4,3.0,NaN,NaN,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,201805,AS015233,7,NaN,NaN,NaN,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,201805,AS015315,3,6.0,NaN,NaN,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,201805,AS015739,5,7.0,NaN,NaN,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [7]:
# 'uselog'와 'exit_customer'를 left join하여 'exit_uselog'를 만들었기 때문에, 'exit_uselog'내 결측치를 제거해야지만 해당 데이터 셋에 탈퇴신청한 회원의 데이터만 남게 됨 
exit_uselog = exit_uselog.dropna(subset = ["exit_date"])
print(len(exit_uselog))
exit_uselog.head()

1104

,연월,customer_id,count_0,count_1,gender,start_date,end_date,is_deleted,class,class_name,campaign_id,campaign_name,mean,median,max,min,routine_flg,calc_date,membership_period,exit_date
19,201805,AS055680,3,3.0,M,2018-03-01,2018-06-30,1.0,C01,0_종일,CA1,2_일반,3.000000,3.0,3.0,3.0,0.0,2018-06-30,3.0,2018-05-30 00:00:00
57,201805,AS169823,2,3.0,M,2017-11-01,2018-06-30,1.0,C01,0_종일,CA1,2_일반,3.000000,3.0,4.0,2.0,1.0,2018-06-30,7.0,2018-05-30 00:00:00
110,201805,AS305860,5,3.0,M,2017-06-01,2018-06-30,1.0,C01,0_종일,CA1,2_일반,3.333333,3.0,5.0,2.0,0.0,2018-06-30,12.0,2018-05-30 00:00:00
128,201805,AS363699,5,3.0,M,2018-02-01,2018-06-30,1.0,C01,0_종일,CA1,2_일반,3.333333,3.0,5.0,2.0,0.0,2018-06-30,4.0,2018-05-30 00:00:00
147,201805,AS417696,1,4.0,F,2017-09-01,2018-06-30,1.0,C03,2_야간,CA1,2_일반,2.000000,1.0,4.0,1.0,0.0,2018-06-30,9.0,2018-05-30 00:00:00

In [ ]:
conti_customer = customer.loc[customer["is_deleted"] == 0]
conti_uselog = pd.merge(uselog, conti_customer, on = "customer_id", how="left")